app/controllers/army_lists_controller.rb

  def index
    @army_lists = ArmyList.all
---
SELECT * FROM "army_lists"

  def show
    @army_list = ArmyList.find(params[:id])
---
SELECT * FROM "army_lists" WHERE ("army_lists"."id" = 1)

  def edit
    @army_list = ArmyList.find(params[:id])
---
SELECT * FROM "army_lists" WHERE ("army_lists"."id" = 1)

  def create
    @army_list = ArmyList.new(params[:army_list])

    respond_to do |format|
      if @army_list.save
---
INSERT INTO "army_lists" ("name", "player", "created_at", "updated_at") VALUES('BA Death assault', 'Phuoc Do', '2010-05-08 12:50:43', '2010-05-08 12:50:43')

  def update
    @army_list = ArmyList.find(params[:id])

    respond_to do |format|
      if @army_list.update_attributes(params[:army_list])
---
SELECT * FROM "army_lists" WHERE ("army_lists"."id" = 1)
UPDATE "army_lists" SET "updated_at" = '2010-05-09 21:20:05', "name" = 'BA Raven Death' WHERE "id" = 1

  def destroy
    @army_list = ArmyList.find(params[:id])
    @army_list.destroy
---
SELECT * FROM "army_lists" WHERE ("army_lists"."id" = 3)
DELETE FROM "army_lists" WHERE "id" = 3