app/controllers/builder_controller.rb

SELECT * FROM "army_lists"
---
  def index
    @army_lists = ArmyList.all

SELECT * FROM "army_lists" WHERE ("army_lists"."id" = 1)
---
  def edit
    @army_list = ArmyList.find(params[:id])

SELECT * FROM "troop_choices"
SELECT * FROM "army_lists" WHERE ("army_lists"."id" = 1)
---
  def add_squad
    @troop_choices = TroopChoice.all
    @army_list = ArmyList.find(params[:id])

SELECT * FROM "army_lists" WHERE ("army_lists"."id" = 1)
SELECT * FROM "squad_items" WHERE ("squad_items"."id" = 1)
SELECT * FROM "unit_items" WHERE ("unit_items".squad_id = 48)
INSERT INTO "squads" ("name", "created_at", "updated_at", "squad_item_id", "army_list_id") VALUES('Commander Dante', '2010-05-08 13:38:05', '2010-05-08 13:38:05', 1, 1)
INSERT INTO "unit_items" ("squad_id", "created_at", "unit_id", "updated_at", "count") VALUES(42, '2010-05-08 13:38:05', 1, '2010-05-08 13:38:05', 1)
SELECT * FROM "squad_item_units" WHERE ("squad_item_units".squad_item_id = 1)
SELECT * FROM "squads" WHERE ("squads".army_list_id = 1)
SELECT * FROM "units" WHERE ("units"."id" = 1)
---
  def add_new_squad
    @army_list = ArmyList.find(params[:id])
    squad_item = SquadItem.find(params[:squad_item])

    @squad = Squad.new
    @squad.army_list_id = @army_list.id
    @squad.squad_item_id = squad_item.id
    @squad.name = squad_item.name
    @squad.save!

    # add unit_items based on squad item
    squad_item.squad_item_units.each do |squad_item_unit|

SELECT * FROM "army_lists" WHERE ("army_lists"."id" = 48)
SELECT * FROM "squads" WHERE ("squads"."id" = 1)
---
  def modify
    @army_list = ArmyList.find(params[:id])
    @squad = Squad.find(params[:squad])

SELECT * FROM "unit_items" WHERE ("unit_items"."id" = 70)
UPDATE "unit_items" SET "updated_at" = '2010-05-09 21:12:59', "count" = 1 WHERE "id" = 73
---
  def add
    unit_item = UnitItem.find(params[:unit_item])
    if unit_item.count.nil?
      unit_item.count = 1
    elsif unit_item.count >= unit_item.max
      flash[:notice] = "Can not go above max #{unit_item.max}"
    else
      unit_item.count += 1
    end
    unit_item.save!

SELECT * FROM "unit_items" WHERE ("unit_items"."id" = 70)
UPDATE "unit_items" SET "updated_at" = '2010-05-09 21:13:02', "count" = 0 WHERE "id" = 73
---
  def substract
    unit_item = UnitItem.find(params[:unit_item])
    if unit_item.count.nil?
      unit_item.count = 0
    elsif unit_item.count <= unit_item.min
      flash[:notice] = "Can not go below min #{unit_item.min}"
    else
      unit_item.count -= 1
    end
    unit_item.save!