app/controllers/squad_items_controller.rb

  def index
    @squad_items = SquadItem.all
---
SELECT * FROM "squad_items"

  def show
    @squad_item = SquadItem.find(params[:id])
---
SELECT * FROM "squad_items" WHERE ("squad_items"."id" = 1)

  def create
    @squad_item = SquadItem.new(params[:squad_item])

    respond_to do |format|
      if @squad_item.save
---
INSERT INTO "squad_items" ("name", "created_at", "troop_choice_id", "updated_at") VALUES('Astorath', '2010-05-06 00:23:09', 1, '2010-05-06 00:23:09')