app/controllers/squad_item_units_controller.rb

  def index
    @squad_item_units = SquadItemUnit.all
---
SELECT * FROM "squad_item_units"

  def show
    @squad_item_unit = SquadItemUnit.find(params[:id])
---
SELECT * FROM "squad_item_units" WHERE ("squad_item_units"."id" = 1)
SELECT * FROM "units" WHERE ("units"."id" = 1)

  def edit
    @squad_item_unit = SquadItemUnit.find(params[:id])
---
SELECT * FROM "squad_item_units" WHERE ("squad_item_units"."id" = 2)

  def create
    @squad_item_unit = SquadItemUnit.new(params[:squad_item_unit])

    respond_to do |format|
      if @squad_item_unit.save
---
INSERT INTO "squad_item_units" ("created_at", "unit_id", "default", "updated_at", "squad_item_id", "max", "min") VALUES('2010-05-06 21:06:04', 1, 1, '2010-05-06 21:06:04', 1, 1, 1)