app/controllers/squads_controller.rb

  def index
    @squads = Squad.all
---
SELECT * FROM "squads"

  def show
    @squad = Squad.find(params[:id])
---
SELECT * FROM "squads" WHERE ("squads"."id" = 1)

  def add_new_squad
    @squad = Squad.new
    squad_item = SquadItem.find(params[:squad_item])
    @squad.squad_item_id = squad_item.id
    @squad.name = squad_item.name
    @squad.save!

    # add unit_items based on squad item
    squad_item.squad_item_units.each do |squad_item_unit|
---
SELECT * FROM "squad_items" WHERE ("squad_items"."id" = 1)
INSERT INTO "squads" ("name", "created_at", "updated_at", "troop_choice_id", "squad_item_id") VALUES('Commander Dante', '2010-05-07 17:28:24', '2010-05-07 17:28:24', 1, 1)
INSERT INTO "unit_items" ("squad_id", "created_at", "unit_id", "updated_at", "count") VALUES(NULL, '2010-05-06 21:10:19', 1, '2010-05-06 21:10:19', 1)
SELECT * FROM "squad_item_units" WHERE ("squad_item_units".squad_item_id = 1)
SELECT * FROM "squad_items"
SELECT * FROM "units" WHERE ("units"."id" = 1)

  def edit
    @squad = Squad.find(params[:id])
---
SELECT * FROM "squads" WHERE ("squads"."id" = 1)

  def create
    @squad = Squad.new(params[:squad])

    respond_to do |format|
      if @squad.save
---
INSERT INTO "squads" ("name", "created_at", "updated_at", "squad_item_id") VALUES('Death Company', '2010-05-07 17:40:50', '2010-05-07 17:40:50', 21)

  def update
    @squad = Squad.find(params[:id])

    respond_to do |format|
      if @squad.update_attributes(params[:squad])
---
SELECT * FROM "squads" WHERE ("squads"."id" = 4)
UPDATE "squads" SET "updated_at" = '2010-05-05 22:29:13', "name" = 'Tactical Squad Bravo' WHERE "id" = 4

  def destroy
    @squad = Squad.find(params[:id])
    @squad.unit_items.collect {|u| u.destroy}
---
SELECT * FROM "squads" WHERE ("squads"."id" = 1)
DELETE FROM "squads" WHERE "id" = 1
DELETE FROM "unit_items" WHERE "id" = 42
SELECT * FROM "unit_items" WHERE ("unit_items".squad_id = 27)

  def add_squad
    @troop_choices = TroopChoice.all
---
SELECT * FROM "troop_choices"

  def modify
    @squad = Squad.find(params[:id])
---
SELECT * FROM "squads" WHERE ("squads"."id" = '--- :squad

  def add
    unit_item = UnitItem.find(params[:unit_item])
    if unit_item.count.nil?
      unit_item.count = 1
    elsif unit_item.count >= unit_item.max
      flash[:notice] = "Can not go above max #{unit_item.max}"
    else
      unit_item.count += 1
    end
    unit_item.save!
---
SELECT * FROM "unit_items" WHERE ("unit_items"."squad_id" IS NULL AND "unit_items"."unit_id" = '1') LIMIT 1
UPDATE "unit_items" SET "updated_at" = '2010-05-05 21:53:44', "count" = 1 WHERE "id" = 1

  def substract
    unit_item = UnitItem.find(params[:unit_item])
    if unit_item.count.nil?
      unit_item.count = 0
    elsif unit_item.count <= unit_item.min
      flash[:notice] = "Can not go below min #{unit_item.min}"
    else
      unit_item.count -= 1
    end
    unit_item.save!
---
SELECT * FROM "unit_items" WHERE ("unit_items"."squad_id" = '1' AND "unit_items"."unit_id" = '1') LIMIT 1
UPDATE "unit_items" SET "updated_at" = '2010-05-05 22:18:58', "count" = 8 WHERE "id" = 1