app/controllers/troop_choices_controller.rb

SELECT * FROM "troop_choices"
---
  def index
    @troop_choices = TroopChoice.all