app/controllers/units_controller.rb

SELECT * FROM "units"
---
  def index
    @units = Unit.all

SELECT * FROM "units" WHERE ("units"."id" = 8)
---
  def show
    @unit = Unit.find(params[:id])

SELECT * FROM "units" WHERE ("units"."id" = 2)
---
  def edit
    @unit = Unit.find(params[:id])

INSERT INTO "units" ("name", "created_at", "updated_at", "troop_choice_id", "point") VALUES('Astorath', '2010-05-05 23:20:45', '2010-05-05 23:20:45', 1, 225)
---
  def create
    @unit = Unit.new(params[:unit])

    respond_to do |format|
      if @unit.save

SELECT * FROM "units" WHERE ("units"."id" = 2)
UPDATE "units" SET "updated_at" = '2010-05-05 23:21:00', "troop_choice_id" = 2 WHERE "id" = 8
---
  def update
    @unit = Unit.find(params[:id])

    respond_to do |format|
      if @unit.update_attributes(params[:unit])